{
  "versions": [
    {
      "version": "1.8.0",
      "date": "28.02.2022",
      "note": "<h3>What's new</h3><ul> <li> Platform Administrators can now use “Notifications” feature to publish notification banners and modals to inform all platform users about upcoming maintenance. </li> <li> Platform-wise metrics on the VRE Home Page give an overview of platform users, Projects, data and resources. </li></ul><h3>Improvements</h3><ul> <li> Improved platform automated deployment resulting in shorter maintenance windows. </li></ul><h3>Bug Fixes</h3><ul> <li> Fixed bug that caused invited pending users to display on Project Members pages. </li> <li> Fixed bug that caused approved copy tasks to not carry parent folder structure. </li> <li> Fixed bug that caused failure when downloading files and/or folders within a copy request. </li> <li>Fixed bug that caused failure when uploading files from Safari.</li></ul>"
    },
    {
      "version": "1.7.0",
      "date": "07.12.2021",
      "note": "<h3>What's new</h3> <ul> <li> Users with Project Collaborator role can now use a “Request to Core” feature to submit requests to have their data copied from their Project Green Room folder to the Core. The requests will be reviewed and approved by a Project Administrator. </li> <li> File Lock mechanism implemented within Project and Dataset file operations to avoid synchronous file operation conflicts. </li> <li> The VRE Command Line interface now supports basic operations on the Charité High Performance Computing cluster (HPC@Charité) including user authentication, job submission, and job status monitoring. </li> </ul> <h3>Improvements</h3> <ul> <li> Adopted the pydantic Basesettings class to manage application settings and configurations. </li> <li> Deployed new backup tasks for more granular database snapshotting. </li> <li> Improved Command Line Interface print out message for large data operations. </li> <li> Updated the default data copy rule for duplicate file/folder name handling. </li> </ul> <h3>Bug Fixes</h3> <ul> <li> Fixed bug that caused incorrect file path within file activities advanced search interface. </li> <li> Fixed bug that caused system tag to be missing from file/folders in Green Room. </li> <li> Fixed bug that caused failure when sorting by Create Time in File Explorer. </li> <li> Fixed bug that caused data lineage graph to display wrong deleted file name. </li> </ul>"
    },
    {
      "version": "1.6.0",
      "date": "01.11.2021",
      "note": "<h3>What's new</h3><ul> <li>The VRE website was redesigned and rebranded to include additional content, as well as the option for new users to request a VRE Test Account. </li> <li>The Blue Brain Nexus integration was deployed on the VRE to provide users with an interactive Knowledge Graph solution for their Datasets. </li> <li>The VRE Command-Line Tool now supports the import of Dataset annotations into the Knowledge Graph, annotations can now be indexed, linked, and queried for greater Dataset discoverability. </li></ul><h3>Improvements</h3><ul> <li>Optimized the performance of large folder operations, such as folder copy and deletion.</li> <li>Improved the user invitation workflow error handling. </li> <li>Migrated from Helm v2 to Helm v3 for improved security and support of third party dependencies. </li> <li>New backup tasks deployed for more granular database snapshotting. </li></ul><h3>Bug Fixes</h3><ul> <li>Fixed bug causing file download to fail for files in the Trash Bin.</li> <li>Fixed bug that caused a duplicated folder to be created during folder import into a Dataset.</li> <li>Fixed bug that caused a duplicated user name folder to be created when removing and re-inviting users to a Project.</li> <li>Fixed bug that affected the annotations of a parent folder of deleted files or folders. </li></ul>"
    },
    {
      "version": "1.5.0",
      "date": "30.09.2021",
      "note": " <h3>What's new</h3> <ul> <li> Dataset curation and annotation - users can now annotate their datasets with the default VRE Dataset Schemas, by creating a custom schema, or through upload of the openMINDS Schemas. </li> <li> Dataset Versioning - users can now publish new Dataset versions by designating the release as major or minor and providing version notes. </li> <li> A BIDS Dataset validator is now available for users to validate the structure and integrity of their Datasets in accordance with the BIDS specification. </li> <li> Users can now monitor asynchronous file and folder operations statuses within the Dataset file panel. </li> <li> The VRE command-line tool now supports Dataset listing and downloading, as well as Green Room Data downloading from Green Room zone Workbench VM. </li> </ul> <h3>Improvements</h3> <ul> <li> The VRE command-line interface now supports file download based on Global Entity ID (GEID) and enhanced security measures through session control. </li> <li> Enriched Dataset curation features including file/folder renaming and plain-text file previewer. </li> <li> Upgrades to the file lock mechanism to avoid synchronous file/folder operation conflicts. </li> <li> Optimized MinIO permission control policy to integrate with the VRE IDP Keycloak. </li> </ul> <h3>Bug Fixes</h3> <ul> <li> Fixed bug causing an empty folder to appear when a file is moved out of a folder within Datasets. </li> <li> Fixed bug preventing Collaborators from adding Project data uploaded by others into their Datasets. </li> <li> Fixed bug that allowed Dataset Schemas to be submitted without required fields. </li> <li> Fixed bug causing contents of folders to be unavailable after copying to Core. </li> </ul>"
    },
    {
      "version": "1.4.0",
      "date": "31.07.2021",
      "note": "<h3>What's new</h3> <ul> <li> MinIO (an object storage solution) was deployed as the primary storage backend to support encryption at rest, versioning, and common data operations. </li> <li> VRE Dataset features were implemented to organize research data by Dataset creation, project data import, and provenance tracking within the Dataset. </li> <li> VRE command-line tool now supports PACS data uploading and annotation to the VRE. </li> <li>Project members can now add tags and File Attributes to folders.</li> </ul> <h3>Improvements</h3> <ul> <li> Updated the VRE command-line interface to include support for file download from MinIO. </li> <li> Optimized backend user authorization modelling by rolling out Role-Based Access Control (RBAC) approach. </li> <li> Upgraded the zip contents previewer to support object storage solution. </li> <li>Enriched File Query feature to support querying folders.</li> </ul> <h3>Bug Fixes</h3> <ul> <li> Fixed bug causing record duplication when a file is moved to another directory within Datasets. </li> <li> Fixed bug causing Zip contents previewer to display incorrect folder structure. </li> <li> Fixed bug causing Dataset Activity to display incorrect file deletion and import logs. </li> </ul>"
    },
    {
      "version": "1.3.0",
      "date": "31.05.2021",
      "note": "<h3>What's new</h3> <ul> <li> Enhanced folder operations - users can now create, copy, and delete entire folder trees directly within the File Explorer. </li> <li>Folders can now be added to and removed from personal Collections. </li> <li> Project-based Workbench tools can be configured directly from the Portal by System Administrators. </li> <li> REDCap data integration is now available to Project members, a sample data visualization dashboard for integrated REDCap data is available through Superset.  </li> </ul> <h3>Improvements</h3> <ul> <li> Support for folder upload and download via the Command Line Interface. </li> <li>Support for file metadata in the VRE Core Zone.</li> <li>Updated User Support documentation is now available in the VRE Public Wiki. </li> </ul> <h3>Bug Fixes</h3> <ul> <li> Fixed bug causing Data Lineage graph to displays incorrect file location and type in VRE Core. </li> <li>Resolved folder duplication bug that was occurring when uploading files directly into a folder. </li> <li>Resolved issue preventing File Previewer from opening for zip files contained within folders.</li> <li>Fixed bug causing File Attributes not to appear for files added to Collections.</li> </ul>"
    },
    {
      "version": "1.2.0",
      "date": "30.04.2021",
      "note": " <h3>What's new</h3> <ul> <li> User invitation and onboarding workflows were updated to facilitate federation of VRE accounts with the Charite Active Directory. </li> <li> File Query feature was updated to allow Project members to search file metadata. </li> <li> An authentication flow for Project role-based access control to workbench tools was implemented. </li> <li> Users can now upload files and folders into existing folders within the Portal File Explorer. </li> </ul> <h3>Bug Fixes</h3> <ul> <li> Fixed bug that was causing the number of files to be displayed incorrectly in the File Statistics card after folder uploading. </li> <li> Fixed bug causing the File Query search button to disappear when a user modified their search criteria. </li> <li> Fixed bug causing missing File Attributes and incorrect process times to be displayed in the Data Lineage Graph. </li> <li> Fixed permission control for Project Collaborator's view access to deleted files originating from the Project Core zone. </li> </ul> <h3>Improvements</h3> <ul> <li> Updated Project folder structure to a simplified UI in the File Explorer.</li> <li>Updated File Query interface to improve File Attributes search capabilities.</li> <li> Refined permission control in VRE XWiki for Project-based content management. </li> <li>Formalized VRE Command Line Tool arguments and options.</li> <li> Updated REDCap data transformation script to include descriptive metadata fields. </li> </ul>"
    },
    {
      "version": "1.1.1",
      "date": "31.03.2021",
      "note": "<h3>What's new</h3> <ul> <li>Users can now upload data in a folder structure and view folder contents in the File Explorer.</li> <li>Project Service Request feature implemented to support Project-based services access requests and notifications.</li> <li>Development for back-end storage of file metadata to support advanced File Query feature.</li> </ul> <h3>Bug Fixes</h3> <ul> <li>Fixed bug causing files to display incorrectly when switching between folders in the File Explorer. </li> </ul> <h3>Improvements</h3> <ul> <li>Updated Portal terminology from File Manifest to File Attribute.</li> <li>Improved display responsivity in tables during Portal window re-sizing.</li>  </ul>"
    },

    {
      "version": "1.1.0",
      "date": "15.03.2021",
      "note": "<h3>What's new</h3> <ul> <li>Major changes to UI/UX styling on Project Canvas and all other Portal pages.</li> <li>Project Announcement feature implemented to support Project-based announcement publishing and notification.</li> <li>Command Line Tool updated to support customized file tag attaching and data lineage creation during uploading.</li> <li>Apache Superset, an external service configured on the Project level, was deployed with Single Sign-On integration.</li> </ul> <h3>Bug Fixes</h3> <ul> <li>Removed flashing error messages occurring during URL loading in Portal Home Page. </li> <li>Fixed bug causing missing Project invitation information in Administrators Console.</li> <li>Fixed UI layout bug occurring in File Explorer when accessing the Portal with Firefox.</li> <li>Improved the stability of large file downloading.</li> </ul>"
    },
    {
      "version": "1.0.0",
      "date": "15.02.2021",
      "note": "<h3>What’s new</h3> <ul> <li>Data deletion protocol implemented for moving data into zone-specific Trash Bins.</li><li>A Project File Manifest Template creation and file attachment feature for describing and categorizing data can now be created and configured by Administrators.</li><li>A File Manifest can be attached by file uploaders or Project Administrator in the Green Room.</li><li>External open-source services of XWiki and Guacamole were deployed and configured with VRE Portal for documentation management and workbench initiation.</li><li>Content Previewer feature now allows users to view file structures inside ZIP files within the File Explorer.</li></ul> <h3>Bug Fixes</h3> <ul> <li> Email notifications now can be sent by Platform Administrators to specific platform users from the Administrators Console.</li><li>Portal release notes are now available in the Portal page footer.</li> <li>Fixed audit logs bug that was displaying incorrect file activities time.</li> </ul>"
    },
    {
      "version": "0.3.0",
      "date": "15.12.2020",
      "note": "<h3>What’s new</h3><ul><li>Single Sign-On Integration implemented between VRE Portal and workbench clients</li><li>Manual Data Copy workflow implemented for copying data from Green Room to Core.</li><li>Personal Collections can now be created by users for grouping and organizing files.</li></ul><h3>Bug Fixes</h3><ul><li>Attachments can now be added to support requests.</li><li>Sending a new platform invitation will now cause any previous invitations sent to the same email address to expire.</li><li>Fixed issue causing white page to appear on manual logout instead of the login page.</li><li>Fixed 403 errors occurring on page refresh in the Administrators Console.</li><li>Fixed issue in File Statistics that was causing logs from the previous day to be displayed.</li><li>Minor fixes to the User Management tab.</li></ul>"
    },
    {
      "version": "0.2.0",
      "date": "30.11.2020",
      "note": "<h3>What's new</h3><ul><li>Enhanced file tagging &amp; annotation</li><li>Data lineage graph</li><li>Search Project attributes</li><li>Platform Administrators user management console, Search Panel and Properties Side Panel</li><li>Updated URL to include “/VRE”extension</li><li>Revised content for clarity and flow.</li></ul>"
    },
    {
      "version": "0.1.0",
      "date": "28.10.2020",
      "note": "<h3>What’s new</h3><ul><li>Initial Version</li><li>Updated text and screenshots for clarity; </li><li>Added Change Log</li></ul>"
    }
  ]
}
