{
  "versions": [
    {
      "version": "1.2.0",
      "date": "30.04.2021",
      "note": "<h3>What's new</h3> <ul> <li> Added the new user invitation and onboarding workflow to support the AD federation. </li> <li> Implemented advanced query interface to support the search based on metadata and attributes. </li> <li> Implemented new authentication flows to enable role based access control on Workbench tools. </li> <li>Added the feature to support folder upload.</li> </ul> <h3>Bug Fixes</h3> <ul> <li> File Statistic card displays wrong total file counts after folder uploading. </li> <li> The search button disappears from the Advance Query UI when user modified the search criterions. </li> <li> Data Lineage Graph shows incorrect processing time and incomplete file attributes for data uploaded by VRE CLI. </li> <li> Project Collaborators could not see files deleted from project Core zone in trash bin. </li> </ul> <h3>Improvements</h3> <ul> <li>The project folder panel in file explorer is simplified.</li> <li>Improved usability of Advanced Query.</li> <li> Refined access control in VRE XWiki to separate the project content. </li> <li>Standardized VRE CLI arguments and options.</li> <li> Updated REDCap data transformation script to include metadata fields. </li> </ul>"
    },
    {
      "version": "1.1.1",
      "date": "31.03.2021",
      "note": "<h3>What's new</h3> <ul> <li>Users can now upload data in a folder structure and view folder contents in the File Explorer.</li> <li>Project Service Request feature implemented to support Project-based services access requests and notifications.</li> <li>Development for back-end storage of file metadata to support advanced File Query feature.</li> </ul> <h3>Bug Fixes</h3> <ul> <li>Fixed bug causing files to display incorrectly when switching between folders in the File Explorer. </li> </ul> <h3>Improvements</h3> <ul> <li>Updated Portal terminology from File Manifest to File Attribute.</li> <li>Improved display responsivity in tables during Portal window re-sizing.</li>  </ul>"
    },

    {
      "version": "1.1.0",
      "date": "15.03.2021",
      "note": "<h3>What's new</h3> <ul> <li>Major changes to UI/UX styling on Project Canvas and all other Portal pages.</li> <li>Project Announcement feature implemented to support Project-based announcement publishing and notification.</li> <li>Command Line Tool updated to support customized file tag attaching and data lineage creation during uploading.</li> <li>Apache Superset, an external service configured on the Project level, was deployed with Single Sign-On integration.</li> </ul> <h3>Bug Fixes</h3> <ul> <li>Removed flashing error messages occurring during URL loading in Portal Home Page. </li> <li>Fixed bug causing missing Project invitation information in Administrators Console.</li> <li>Fixed UI layout bug occurring in File Explorer when accessing the Portal with Firefox.</li> <li>Improved the stability of large file downloading.</li> </ul>"
    },
    {
      "version": "1.0.0",
      "date": "15.02.2021",
      "note": "<h3>What’s new</h3> <ul> <li>Data deletion protocol implemented for moving data into zone-specific Trash Bins.</li><li>A Project File Manifest Template creation and file attachment feature for describing and categorizing data can now be created and configured by Administrators.</li><li>A File Manifest can be attached by file uploaders or Project Administrator in the Green Room.</li><li>External open-source services of XWiki and Guacamole were deployed and configured with VRE Portal for documentation management and workbench initiation.</li><li>Content Previewer feature now allows users to view file structures inside ZIP files within the File Explorer.</li></ul> <h3>Bug Fixes</h3> <ul> <li> Email notifications now can be sent by Platform Administrators to specific platform users from the Administrators Console.</li><li>Portal release notes are now available in the Portal page footer.</li> <li>Fixed audit logs bug that was displaying incorrect file activities time.</li> </ul>"
    },
    {
      "version": "0.3.0",
      "date": "15.12.2020",
      "note": "<h3>What’s new</h3><ul><li>Single Sign-On Integration implemented between VRE Portal and workbench clients</li><li>Manual Data Copy workflow implemented for copying data from Green Room to Core.</li><li>Personal Collections can now be created by users for grouping and organizing files.</li></ul><h3>Bug Fixes</h3><ul><li>Attachments can now be added to support requests.</li><li>Sending a new platform invitation will now cause any previous invitations sent to the same email address to expire.</li><li>Fixed issue causing white page to appear on manual logout instead of the login page.</li><li>Fixed 403 errors occurring on page refresh in the Administrators Console.</li><li>Fixed issue in File Statistics that was causing logs from the previous day to be displayed.</li><li>Minor fixes to the User Management tab.</li></ul>"
    },
    {
      "version": "0.2.0",
      "date": "30.11.2020",
      "note": "<h3>What's new</h3><ul><li>Enhanced file tagging &amp; annotation</li><li>Data lineage graph</li><li>Search Project attributes</li><li>Platform Administrators user management console, Search Panel and Properties Side Panel</li><li>Updated URL to include “/vre”extension</li><li>Revised content for clarity and flow.</li></ul>"
    },
    {
      "version": "0.1.0",
      "date": "28.10.2020",
      "note": "<h3>What’s new</h3><ul><li>Initial Version</li><li>Updated text and screenshots for clarity; </li><li>Added Change Log</li></ul>"
    }
  ]
}
